0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            calculated;
    }

    farFieldMoving
    {
        type            calculated;
    }
    rightWall
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
    }

    axis
    {
        type            slip;
    }

    leftWall
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
    }

    farField
    {
        type            slip;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
}


// ************************************************************************* //
