constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("libsixDoFRigidBodyMotion.so");

motionSolver        sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (movingWall);
    innerDistance   0.001;
    outerDistance   0.03;

    centreOfMass    (0.055 0.004 0.005);

    // Cuboid dimensions
    Lx              0.035;
    Ly              0.007;
    Lz              0.005;

    // Density of the solid
    rhoSolid        3000;

    // Cuboid mass
    mass            #calc "$rhoSolid*$Lx*$Ly*$Lz";
    // velocity        (0.1 0 0 );
    // Cuboid moment of inertia about the centre of mass
    momentOfInertia #codeStream
    {
        codeInclude
        #{
            #include "diagTensor.H"
        #};

        code
        #{
            scalar sqrLx = sqr($Lx);
            scalar sqrLy = sqr($Ly);
            scalar sqrLz = sqr($Lz);
            os  <<
                $mass
               *diagTensor(sqrLy + sqrLz, sqrLx + sqrLz, sqrLx + sqrLy)/12.0;
        #};
    };

    report          on;
    accelerationRelaxation 0.3;
    accelerationDamping 0.3;

    solver
    {
        type Newmark;
    }

    constraints
    {
        // fixedPoint
        // {
        //     sixDoFRigidBodyMotionConstraint point;
        //     centreOfRotation (0.5 0.45 0.1);
        // }

        fixedLine
        {
            sixDoFRigidBodyMotionConstraint line;
            // centreOfRotation (0.5 0.45 0.1);
            direction (1 0 0);
        }

        fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (1 0 0);
        }
    }

    restraints
    {
        //Restraint Forces

        //Typical Restriant Force Definition
        spring
        {
            sixDoFRigidBodyMotionRestraint linearSpring;
     anchor                                (-0.1 .0025 .005);
     refAttachmentPt                       (-.07 0.0025 0.005);
     stiffness                             0.5;  //units of N/m
     damping                               0;   //units of Ns/m
     restLength                            0.02;   //units of m
        }

        // Damper
        // {
        //     sixDoFRigidBodyMotionRestraint linearDamper;
        //     coeff                               0.2;
        // }
    }
}



// ************************************************************************* //
