constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    movingWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          85;
        startFace       5930;
    }
    farFieldMoving
    {
        type            patch;
        nFaces          50;
        startFace       6015;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          35;
        startFace       6065;
    }
    axis
    {
        type            patch;
        nFaces          70;
        startFace       6100;
    }
    leftWall
    {
        type            patch;
        nFaces          30;
        startFace       6170;
    }
    farField
    {
        type            patch;
        nFaces          70;
        startFace       6200;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3050;
        startFace       6270;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3050;
        startFace       9320;
    }
)

// ************************************************************************* //
