system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;
h1       0.75;
h2       0.75;
H         1.5;
x0        -10;
x1        -7.0;
x3        -3.5;
x4        .5;
vertices
(
    ($x0 0 0) //    0
    ($x1 0 0) //    1
    ($x3 0 0) //   2
    ($x4 0 0) //    3

    ($x0 $h1 0) //    4
    ($x1 $h1 0) //    5
    ($x3 $h2 0) //    6
    ($x4 $h2 0) //    7

    ($x0 $H 0) //     8
    ($x1 $H 0) //    9
    ($x3 $H 0) //   10
    ($x4 $H 0) //    11

    ($x0 $h1 1) //  12
    ($x1 $h1 1) //    13
    ($x3 $h2 1) //    14

    ($x4 $h2 1) //    15
    ($x0 $H 1) //  16
    ($x1 $H 1) //    17
    ($x3 $H 1) //    18
    ($x4 $H 1) //    19

    ($x0 0 1) //    20
    ($x1 0 1) //    21
    ($x3 0 1) //   22
    ($x4 0 1) //    23

);

blocks
(
    hex (0 1 5 4 20 21 13 12) (30 15 1) simpleGrading (1 1 1)
    hex (2 3 7 6 22 23 15 14) (40 20 1) simpleGrading (1 1 1)
    hex (4 5 9 8 12 13 17 16) (30 15 1) simpleGrading (1 1 1)
    hex (5 6 10 9 13 14 18 17) (50 15 1) simpleGrading (1 1 1)
    hex (6 7 11 10 14 15 19 18) (40 15 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (1 5 13 21)
            (5 6 14 13)
            (2 22 14 6)
        );
    }
    farFieldMoving
    {
        type patch;
        faces
        (
            (9 17 18 10)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (3 7 15 23)
            (7 11 19 15)
        );
    }
    axis
    {
        type patch;
        faces
        (
            (0 1 21 20)  //???????????????????????
            (2 3 23 22)  //???????????????????????
        );
    }
    leftWall
    {
        type patch;
        faces
        (
            (0 20 12 4)
            (4 12 16 8)
        );
    }
    farField
    {
        type patch;
        faces
        (
            (8 16 17 9)
            (10 18 19 11)
        );
    }
    back
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
        );
    }
    front
    {
        type empty;
        faces
        (
            (20 21 13 12)
            (22 23 15 14)
            (12 13 17 16)
            (13 14 18 17)
            (14 15 19 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
